// Написать программу вычисления произведения чисел от 1 до N

Console.Clear();
Console.WriteLine("Hello, World!");
